DataProcessors/ЗакрытиеЗаказовПоставщикам_Регламент.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<DataProcessor>
		<Properties>
			<Name>ЗакрытиеЗаказовПоставщикам_Регламент</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДатаНачала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

InformationRegisters/РегламентированныйПроизводственныйКалендарь.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>РегламентированныйПроизводственныйКалендарь</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Пятидневка</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Шестидневка</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КалендарныеДни</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВидДня</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыДнейПроизводственногоКалендаря</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ДатаКалендаря</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Год</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

AccumulationRegisters/ЗаказыПоставщикам.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<Name>ЗаказыПоставщикам</Name>
			<Comment>(Упр)</Comment>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаВзаиморасчетов</Name>
					<Comment>Сумма в валюте взаиморасчетов</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаУпр</Name>
					<Comment>Сумма в валюте упр. учета</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ДоговорКонтрагента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЗаказПоставщику</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаказПоставщику</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СтатусПартии</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыПартийТоваров</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ХарактеристикаНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Цена</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЕдиницаИзмерения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЕдиницыИзмерения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СтавкаНДС</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.СтавкиНДС</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

AccumulationRegisters/РазмещениеЗаказовПокупателей.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<Name>РазмещениеЗаказовПокупателей</Name>
			<Comment>(Упр)</Comment>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ТоварТара</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТоварТара</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ХарактеристикаНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЗаказПокупателя</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаказПокупателя</v8:Type>
						<v8:Type>cfg:DocumentRef.ВнутреннийЗаказ</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЗаказПоставщику</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаказПоставщику</v8:Type>
						<v8:Type>cfg:DocumentRef.ВнутреннийЗаказ</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

Enums/ВидыДнейПроизводственногоКалендаря.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ВидыДнейПроизводственногоКалендаря</Name>
			<Comment>(Общ)</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Рабочий</Name>
					<Comment>(Общ) Рабочий день</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Суббота</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Воскресенье</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Предпраздничный</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Праздник</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ПричиныКорректировкиСборки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ПричиныКорректировкиСборки</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Недостача</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтказКлиента</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Пересорт</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Недопоставка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтказПоставщика</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИстекСрокРезервирования</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОшибкаКратности</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/ЗакрытиеЗаказовПоставщикам.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>ЗакрытиеЗаказовПоставщикам</Name>
			<Comment>(Упр) Закрытие заказов поставщикам без исполнения</Comment>
			<BasedOn>
				<xr:Item>Document.ЗаказПоставщику</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.РазмещениеЗаказовПокупателей</xr:Item>
				<xr:Item>AccumulationRegister.ЗаказыПоставщикам</xr:Item>
				<xr:Item>AccumulationRegister.ЗаказыПокупателей</xr:Item>
				<xr:Item>InformationRegister.ПричиныЗакрытияЗаказов</xr:Item>
				<xr:Item>AccumulationRegister.РасчетыСКонтрагентами</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Comment>Любая дополнительная информация</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СпособЗаполнения</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Заказы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ЗаказПоставщику</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.ЗаказПоставщику</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПричинаЗакрытияЗаказа</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ПричиныЗакрытияЗаказов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Причина</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ПричиныКорректировкиСборки</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Catalogs/МТ_ПредопределенныеЗначения.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>МТ_ПредопределенныеЗначения</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Значение</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
						<v8:Type>xs:string</v8:Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:TypeSet>cfg:AnyRef</v8:TypeSet>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
						<v8:StringQualifiers>
							<v8:Length>512</v8:Length>
						</v8:StringQualifiers>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Список</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:TypeSet>cfg:AnyRef</v8:TypeSet>
								<v8:StringQualifiers>
									<v8:Length>200</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
								<v8:Type>xs:string</v8:Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:TypeSet>cfg:AnyRef</v8:TypeSet>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
								<v8:StringQualifiers>
									<v8:Length>512</v8:Length>
								</v8:StringQualifiers>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

DataProcessors/ЗакрытиеЗаказовПоставщикам_Регламент/Ext/ObjectModule.bsl
Процедура ВыполнитьРаботу() Экспорт 
	
	Если ДатаОкончания = Дата(1,1,1) Тогда
		ДатаОкончания = КонецДня(ТекущаяДата());
	КонецЕсли;
	
	Если ДатаНачала = Дата(1,1,1) Тогда
		ДатаНачала = НачалоДня(ДобавитьМесяц(ДатаОкончания,-1));
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	//+Кабанов А.В. 15.07.2025 # UT10-5323
	"ВЫБРАТЬ
	|	ЗаказПоставщику.Ссылка
	|ПОМЕСТИТЬ ТабЗаказыПоставщику
	|ИЗ
	|	Документ.ЗаказПоставщику КАК ЗаказПоставщику
	|ГДЕ
	|	ЗаказПоставщику.Дата >= &ДатаНачала
	|	И ЗаказПоставщику.Проведен
	|	И ЗаказПоставщику.Дата <= &ДатаОкончания
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ПоступлениеТоваровУслугТовары.ЗаказПоставщику,
	|	ПоступлениеТоваровУслугТовары.Ссылка.Дата КАК ДатаПоступления
	|ПОМЕСТИТЬ ТабЗаказыПоставщикамПоПоступлениям
	|ИЗ
	|	Документ.ПоступлениеТоваровУслуг.Товары КАК ПоступлениеТоваровУслугТовары
	|ГДЕ
	|	ПоступлениеТоваровУслугТовары.ЗаказПоставщику В
	|			(ВЫБРАТЬ
	|				ТабЗаказыПоставщику.Ссылка
	|			ИЗ
	|				ТабЗаказыПоставщику КАК ТабЗаказыПоставщику)
	|	И ПоступлениеТоваровУслугТовары.Ссылка.Проведен
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ПоступлениеТоваровНаОтветственноеХранениеТовары.ЗаказПоставщику,
	|	ПоступлениеТоваровНаОтветственноеХранениеТовары.Ссылка.Дата
	|ИЗ
	|	Документ.ПоступлениеТоваровНаОтветственноеХранение.Товары КАК ПоступлениеТоваровНаОтветственноеХранениеТовары
	|ГДЕ
	|	ПоступлениеТоваровНаОтветственноеХранениеТовары.ЗаказПоставщику В
	|			(ВЫБРАТЬ
	|				ТабЗаказыПоставщику.Ссылка
	|			ИЗ
	|				ТабЗаказыПоставщику КАК ТабЗаказыПоставщику)
	|	И ПоступлениеТоваровНаОтветственноеХранениеТовары.Ссылка.Проведен
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ТабЗаказыПоставщикамПоПоступлениям.ЗаказПоставщику,
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ РегламентированныйПроизводственныйКалендарь.ДатаКалендаря) КАК Дней
	|ПОМЕСТИТЬ ТабСтороннихСкладов
	|ИЗ
	|	ТабЗаказыПоставщикамПоПоступлениям КАК ТабЗаказыПоставщикамПоПоступлениям
	|		ЛЕВОЕ СОЕДИНЕНИЕ ТабЗаказыПоставщику КАК ТабЗаказыПоставщику
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.РегламентированныйПроизводственныйКалендарь КАК РегламентированныйПроизводственныйКалендарь
	|			ПО (НАЧАЛОПЕРИОДА(ТабЗаказыПоставщику.Ссылка.Дата, ДЕНЬ) <= РегламентированныйПроизводственныйКалендарь.ДатаКалендаря)
	|				И (РегламентированныйПроизводственныйКалендарь.ДатаКалендаря <= &ТекДата)
	|		ПО ТабЗаказыПоставщикамПоПоступлениям.ЗаказПоставщику = ТабЗаказыПоставщику.Ссылка
	|ГДЕ
	|	ТабЗаказыПоставщику.Ссылка.IDСклада <> ЗНАЧЕНИЕ(Справочник.СторонниеСклады.ПустаяСсылка)
	|	И РегламентированныйПроизводственныйКалендарь.ВидДня = &ВидДня
	|
	|СГРУППИРОВАТЬ ПО
	|	ТабЗаказыПоставщикамПоПоступлениям.ЗаказПоставщику
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТабСтороннихСкладов.ЗаказПоставщику
	|ПОМЕСТИТЬ НужныеЗаказыПоставщикамСторонниеСклады
	|ИЗ
	|	ТабСтороннихСкладов КАК ТабСтороннихСкладов
	|ГДЕ
	|	ЕСТЬNULL(ТабСтороннихСкладов.ЗаказПоставщику.IDСклада.СкоростьПоставки, 0) <= ТабСтороннихСкладов.Дней
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ТабЗаказыПоставщикамПоПоступлениям.ЗаказПоставщику
	|ПОМЕСТИТЬ НужныеЗаказыПоставщикам
	|ИЗ
	|	ТабЗаказыПоставщикамПоПоступлениям КАК ТабЗаказыПоставщикамПоПоступлениям
	|		ЛЕВОЕ СОЕДИНЕНИЕ ТабЗаказыПоставщику КАК ТабЗаказыПоставщику
	|		ПО ТабЗаказыПоставщикамПоПоступлениям.ЗаказПоставщику = ТабЗаказыПоставщику.Ссылка
	|ГДЕ
	|	ТабЗаказыПоставщику.Ссылка.IDСклада = ЗНАЧЕНИЕ(Справочник.СторонниеСклады.ПустаяСсылка)
	|	И ВЫБОР
	|			КОГДА ТабЗаказыПоставщику.Ссылка.Экспресс = ЛОЖЬ
	|				ТОГДА РАЗНОСТЬДАТ(ТабЗаказыПоставщикамПоПоступлениям.ДатаПоступления, &ТекДата, ДЕНЬ) >= &ЧислоДнейЗакрытия
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	НужныеЗаказыПоставщикамСторонниеСклады.ЗаказПоставщику
	|ИЗ
	|	НужныеЗаказыПоставщикамСторонниеСклады КАК НужныеЗаказыПоставщикамСторонниеСклады
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЗаказыПоставщикамОстатки.ЗаказПоставщику,
	|	ЗаказыПоставщикамОстатки.ЗаказПоставщику.ДоговорПоставщикаТОХ
	|ИЗ
	|	РегистрНакопления.ЗаказыПоставщикам.Остатки(
	|			,
	|			ЗаказПоставщику В
	|				(ВЫБРАТЬ
	|					НужныеЗаказыПоставщикам.ЗаказПоставщику
	|				ИЗ
	|					НужныеЗаказыПоставщикам КАК НужныеЗаказыПоставщикам)) КАК ЗаказыПоставщикамОстатки";
	
	//"ВЫБРАТЬ
	//|	ЗаказПоставщику.Ссылка
	//|ПОМЕСТИТЬ ТабЗаказыПоставщику
	//|ИЗ
	//|	Документ.ЗаказПоставщику КАК ЗаказПоставщику
	//|ГДЕ
	//|	ЗаказПоставщику.Дата >= &ДатаНачала
	//|	И ЗаказПоставщику.Проведен
	//|	И ЗаказПоставщику.Дата <= &ДатаОкончания
	//|;
	//|
	//|////////////////////////////////////////////////////////////////////////////////
	//|ВЫБРАТЬ РАЗЛИЧНЫЕ
	//|	ПоступлениеТоваровУслугТовары.ЗаказПоставщику,
	//|	ПоступлениеТоваровУслугТовары.Ссылка.Дата КАК ДатаПоступления
	//|ПОМЕСТИТЬ ТабЗаказыПоставщикамПоПоступлениям
	//|ИЗ
	//|	Документ.ПоступлениеТоваровУслуг.Товары КАК ПоступлениеТоваровУслугТовары
	//|ГДЕ
	//|	ПоступлениеТоваровУслугТовары.ЗаказПоставщику В
	//|			(ВЫБРАТЬ
	//|				ТабЗаказыПоставщику.Ссылка
	//|			ИЗ
	//|				ТабЗаказыПоставщику КАК ТабЗаказыПоставщику)
	//|	И ПоступлениеТоваровУслугТовары.Ссылка.Проведен
	//|;
	//|
	//|////////////////////////////////////////////////////////////////////////////////
	//|ВЫБРАТЬ РАЗЛИЧНЫЕ
	//|	ТабЗаказыПоставщикамПоПоступлениям.ЗаказПоставщику,
	//|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ РегламентированныйПроизводственныйКалендарь.ДатаКалендаря) КАК Дней
	//|ПОМЕСТИТЬ ТабСтороннихСкладов
	//|ИЗ
	//|	ТабЗаказыПоставщикамПоПоступлениям КАК ТабЗаказыПоставщикамПоПоступлениям
	//|		ЛЕВОЕ СОЕДИНЕНИЕ ТабЗаказыПоставщику КАК ТабЗаказыПоставщику
	//|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.РегламентированныйПроизводственныйКалендарь КАК РегламентированныйПроизводственныйКалендарь
	//|			ПО (НАЧАЛОПЕРИОДА(ТабЗаказыПоставщику.Ссылка.Дата, ДЕНЬ) <= РегламентированныйПроизводственныйКалендарь.ДатаКалендаря)
	//|				И (РегламентированныйПроизводственныйКалендарь.ДатаКалендаря <= &ТекДата)
	//|		ПО ТабЗаказыПоставщикамПоПоступлениям.ЗаказПоставщику = ТабЗаказыПоставщику.Ссылка
	//|ГДЕ
	//|	ТабЗаказыПоставщику.Ссылка.IDСклада <> ЗНАЧЕНИЕ(Справочник.СторонниеСклады.ПустаяСсылка)
	//|	И РегламентированныйПроизводственныйКалендарь.ВидДня = &ВидДня
	//|
	//|СГРУППИРОВАТЬ ПО
	//|	ТабЗаказыПоставщикамПоПоступлениям.ЗаказПоставщику
	//|;
	//|
	//|////////////////////////////////////////////////////////////////////////////////
	//|ВЫБРАТЬ
	//|	ТабСтороннихСкладов.ЗаказПоставщику
	//|ПОМЕСТИТЬ НужныеЗаказыПоставщикамСторонниеСклады
	//|ИЗ
	//|	ТабСтороннихСкладов КАК ТабСтороннихСкладов
	//|ГДЕ
	//|	ЕСТЬNULL(ТабСтороннихСкладов.ЗаказПоставщику.IDСклада.СкоростьПоставки, 0) <= ТабСтороннихСкладов.Дней
	//|;
	//|
	//|////////////////////////////////////////////////////////////////////////////////
	//|ВЫБРАТЬ РАЗЛИЧНЫЕ
	//|	ТабЗаказыПоставщикамПоПоступлениям.ЗаказПоставщику
	//|ПОМЕСТИТЬ НужныеЗаказыПоставщикам
	//|ИЗ
	//|	ТабЗаказыПоставщикамПоПоступлениям КАК ТабЗаказыПоставщикамПоПоступлениям
	//|		ЛЕВОЕ СОЕДИНЕНИЕ ТабЗаказыПоставщику КАК ТабЗаказыПоставщику
	//|		ПО ТабЗаказыПоставщикамПоПоступлениям.ЗаказПоставщику = ТабЗаказыПоставщику.Ссылка
	//|ГДЕ
	//|	ТабЗаказыПоставщику.Ссылка.IDСклада = ЗНАЧЕНИЕ(Справочник.СторонниеСклады.ПустаяСсылка)
	//|	И ВЫБОР
	//|			КОГДА ТабЗаказыПоставщику.Ссылка.Экспресс = ЛОЖЬ
	//|				ТОГДА РАЗНОСТЬДАТ(ТабЗаказыПоставщикамПоПоступлениям.ДатаПоступления, &ТекДата, ДЕНЬ) >= &ЧислоДнейЗакрытия
	//|			ИНАЧЕ ИСТИНА
	//|		КОНЕЦ
	//|
	//|ОБЪЕДИНИТЬ ВСЕ
	//|
	//|ВЫБРАТЬ
	//|	НужныеЗаказыПоставщикамСторонниеСклады.ЗаказПоставщику
	//|ИЗ
	//|	НужныеЗаказыПоставщикамСторонниеСклады КАК НужныеЗаказыПоставщикамСторонниеСклады
	//|;
	//|
	//|////////////////////////////////////////////////////////////////////////////////
	//|ВЫБРАТЬ
	//|	ЗаказыПоставщикамОстатки.ЗаказПоставщику
	//|ИЗ
	//|	РегистрНакопления.ЗаказыПоставщикам.Остатки(
	//|			,
	//|			ЗаказПоставщику В
	//|				(ВЫБРАТЬ
	//|					НужныеЗаказыПоставщикам.ЗаказПоставщику
	//|				ИЗ
	//|					НужныеЗаказыПоставщикам КАК НужныеЗаказыПоставщикам)) КАК ЗаказыПоставщикамОстатки";
	//-Кабанов А.В. 15.07.2025 # UT10-5323
	Запрос.УстановитьПараметр("ДатаНачала", ДатаНачала);
	Запрос.УстановитьПараметр("ДатаОкончания", ДатаОкончания);
	Запрос.УстановитьПараметр("ВидДня", Перечисления.ВидыДнейПроизводственногоКалендаря.Рабочий);
	Запрос.УстановитьПараметр("ТекДата", ТекущаяДата());
	Запрос.УстановитьПараметр("ЧислоДнейЗакрытия", Константы.ЧислоДнейЗакрытияЗаказовНаПополнения.Получить()); 
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если НЕ РезультатЗапроса.Пустой() Тогда 
		
		НовыйДокумент = Документы.ЗакрытиеЗаказовПоставщикам.СоздатьДокумент();
		НовыйДокумент.Дата = ТекущаяДата();
		НовыйДокумент.Комментарий = "Документ создан автоматически регламентым заданием по закрытия документов 'Заказ поставщику'";
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			
			Если ВыборкаДетальныеЗаписи.ЗаказПоставщику.Экспресс
				И ЕстьСмешанныеТоварыПоОбособленнойИБез(ВыборкаДетальныеЗаписи.ЗаказПоставщику)
				И Не ЕстьДваПоступленияСГМИБез(ВыборкаДетальныеЗаписи.ЗаказПоставщику)
				И ВыборкаДетальныеЗаписи.ЗаказПоставщику.IDСкладаСобственныйСклад.ИсключитьИзОбщегоЭкспресса Тогда
				Продолжить;	
			КонецЕсли;
			
			НоваяСтрока = НовыйДокумент.Заказы.Добавить();
			НоваяСтрока.ЗаказПоставщику = ВыборкаДетальныеЗаписи.ЗаказПоставщику;
			НоваяСтрока.Причина = Перечисления.ПричиныКорректировкиСборки.ОтказПоставщика;  
			
		КонецЦикла;
		
		Если НовыйДокумент.Заказы.Количество() > 0 Тогда
			НовыйДокумент.Записать(РежимЗаписиДокумента.Проведение); 	
		КонецЕсли;		
		
	КонецЕсли;
	
КонецПроцедуры 

Функция ЕстьДваПоступленияСГМИБез(ЗаказПоставщику) 
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ПоступлениеТоваровУслугТовары.Ссылка КАК Поступление,
	|	ПоступлениеТоваровУслугТовары.ЗаказПоставщику
	|ПОМЕСТИТЬ ВТ_ПоступленияСГМ
	|ИЗ
	|	Документ.ПоступлениеТоваровУслуг.Товары КАК ПоступлениеТоваровУслугТовары
	|ГДЕ
	|	ПоступлениеТоваровУслугТовары.ЗаказПоставщику = &ЗаказПоставщику
	|	И ПоступлениеТоваровУслугТовары.ГМ <> """"
	|	И ПоступлениеТоваровУслугТовары.Ссылка.Проведен
	|
	|СГРУППИРОВАТЬ ПО
	|	ПоступлениеТоваровУслугТовары.ЗаказПоставщику,
	|	ПоступлениеТоваровУслугТовары.Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПоступлениеТоваровУслугТовары.Ссылка КАК Поступление,
	|	ПоступлениеТоваровУслугТовары.ЗаказПоставщику
	|ПОМЕСТИТЬ ВТ_ПоступленияБезГМ
	|ИЗ
	|	Документ.ПоступлениеТоваровУслуг.Товары КАК ПоступлениеТоваровУслугТовары
	|ГДЕ
	|	ПоступлениеТоваровУслугТовары.ЗаказПоставщику = &ЗаказПоставщику
	|	И ПоступлениеТоваровУслугТовары.ГМ = """"
	|	И ПоступлениеТоваровУслугТовары.Ссылка.Проведен
	|	И НЕ ПоступлениеТоваровУслугТовары.Ссылка В
	|				(ВЫБРАТЬ
	|					ВТ_ПоступленияСГМ.Поступление
	|				ИЗ
	|					ВТ_ПоступленияСГМ)
	|
	|СГРУППИРОВАТЬ ПО
	|	ПоступлениеТоваровУслугТовары.ЗаказПоставщику,
	|	ПоступлениеТоваровУслугТовары.Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Заказ.Ссылка
	|ИЗ
	|	ВТ_ПоступленияСГМ КАК ВТ_ПоступленияСГМ
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЗаказПоставщику КАК Заказ
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_ПоступленияБезГМ КАК ВТ_ПоступленияБезГМ
	|			ПО (ВТ_ПоступленияБезГМ.ЗаказПоставщику = Заказ.Ссылка)
	|		ПО ВТ_ПоступленияСГМ.ЗаказПоставщику = Заказ.Ссылка
	|ГДЕ
	|	Заказ.Ссылка = &ЗаказПоставщику";
	
	Запрос.УстановитьПараметр("ЗаказПоставщику", ЗаказПоставщику); 
	
	Выборка = Запрос.Выполнить().Выбрать(); 
	
	Если Выборка.Следующий() Тогда
		Возврат Истина;
	КонецЕсли;                                
	
	Возврат Ложь;
		
КонецФункции

Функция ЕстьСмешанныеТоварыПоОбособленнойИБез(ЗаказПоставщику)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	РазмещениеЗаказовПокупателейОбороты.ЗаказПокупателя КАК Заказ,
	|	РазмещениеЗаказовПокупателейОбороты.ЗаказПоставщику
	|ПОМЕСТИТЬ ВТ_ЗаказыПокупателя
	|ИЗ
	|	РегистрНакопления.РазмещениеЗаказовПокупателей.Обороты(, , , ЗаказПоставщику = &ЗаказПоставщику) КАК РазмещениеЗаказовПокупателейОбороты
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЗаказПоставщикуТовары.ЗаказПоставщику,
	|	МАКСИМУМ(ВЫБОР
	|			КОГДА НЕ ВЫРАЗИТЬ(ЗаказПоставщикуТовары.Заказ КАК Документ.ЗаказПокупателя).ОбособленнаяОтгрузкаГМИзСтороннегоФилиала
	|				ТОГДА ИСТИНА
	|			ИНАЧЕ ЛОЖЬ
	|		КОНЕЦ) КАК ОбычныеТовары,
	|	МАКСИМУМ(ВЫБОР
	|			КОГДА ВЫРАЗИТЬ(ЗаказПоставщикуТовары.Заказ КАК Документ.ЗаказПокупателя).ОбособленнаяОтгрузкаГМИзСтороннегоФилиала
	|				ТОГДА ИСТИНА
	|			ИНАЧЕ ЛОЖЬ
	|		КОНЕЦ) КАК ОбособленныеТовары
	|ПОМЕСТИТЬ ВТ_Товары
	|ИЗ
	|	ВТ_ЗаказыПокупателя КАК ЗаказПоставщикуТовары
	|
	|СГРУППИРОВАТЬ ПО
	|	ЗаказПоставщикуТовары.ЗаказПоставщику
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Товары.ЗаказПоставщику
	|ИЗ
	|	ВТ_Товары КАК ВТ_Товары
	|ГДЕ
	|	ВТ_Товары.ОбычныеТовары
	|	И ВТ_Товары.ОбособленныеТовары"; 
	
	Запрос.УстановитьПараметр("ЗаказПоставщику", ЗаказПоставщику);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		Возврат Истина;	
	КонецЕсли;         
	
	Возврат Ложь;	
		
КонецФункции 

Процедура ВыполнитьРаботуОтрицательныеОстатки() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	ЗаказыПоставщикамОстатки.ДоговорКонтрагента,
	|	ЗаказыПоставщикамОстатки.ЗаказПоставщику,
	|	ЗаказыПоставщикамОстатки.СтатусПартии,
	|	ЗаказыПоставщикамОстатки.Номенклатура,
	|	ЗаказыПоставщикамОстатки.ХарактеристикаНоменклатуры,
	|	ЗаказыПоставщикамОстатки.Цена,
	|	ЗаказыПоставщикамОстатки.ЕдиницаИзмерения,
	|	ЗаказыПоставщикамОстатки.СтавкаНДС,
	|	ЗаказыПоставщикамОстатки.КоличествоОстаток,
	|	ЗаказыПоставщикамОстатки.СуммаВзаиморасчетовОстаток,
	|	ЗаказыПоставщикамОстатки.СуммаУпрОстаток
	|ИЗ
	|	РегистрНакопления.ЗаказыПоставщикам.Остатки(&Дата, ) КАК ЗаказыПоставщикамОстатки
	|ГДЕ
	|	ЗаказыПоставщикамОстатки.КоличествоОстаток < 0
	|
	|УПОРЯДОЧИТЬ ПО
	|	ЗаказыПоставщикамОстатки.ЗаказПоставщику.Дата";
	
	Запрос.УстановитьПараметр("Дата", ТекущаяДата());
	
	Месяц = Неопределено;
	
	Выб = Запрос.Выполнить().Выбрать();
	СписЗаказов = Новый СписокЗначений;
	ДатаПервогоЗаказа = Неопределено;
	
	Пока выб.Следующий() Цикл
		
		//+Гавриленков В. 22.08.2025 #UT10-5394  
		КоличествоДней = Справочники.МТ_ПредопределенныеЗначения.ПолучитьЗначениеПоСвойству(Справочники.МТ_ПредопределенныеЗначения.НастройкиКоличестваДней, "Количество дней для закрытия заказов постащикам по отрицательным остаткам");
		Если Выб.ЗаказПоставщику.Дата < (ТекущаяДата() - ?(ЗначениеЗаполнено(КоличествоДней), КоличествоДней, 15) * 60 * 60 * 24) Тогда
		//Если Выб.ЗаказПоставщику.Дата < текущаяДата() - 15*60*60*24 тогда
		//-Гавриленков В. 22.08.2025 #UT10-5394
			
			Если СписЗаказов.НайтиПоЗначению(Выб.ЗаказПоставщику) = Неопределено тогда
				
				Если ДатаПервогоЗаказа = Неопределено тогда
					ДатаПервогоЗаказа = Выб.ЗаказПоставщику.Дата;
				КонецЕсли;
				
				СписЗаказов.Добавить(Выб.ЗаказПоставщику);
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
	
	Если СписЗаказов.Количество() > 0 тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		|	ПоступлениеТоваровУслугТовары.ЗаказПоставщику,
		|	МАКСИМУМ(ПоступлениеТоваровУслугТовары.Ссылка.Дата) КАК Дата
		|ИЗ
		|	Документ.ПоступлениеТоваровУслуг.Товары КАК ПоступлениеТоваровУслугТовары
		|ГДЕ
		|	ПоступлениеТоваровУслугТовары.ЗаказПоставщику В(&ЗаказПоставщику)
		|
		|СГРУППИРОВАТЬ ПО
		|	ПоступлениеТоваровУслугТовары.ЗаказПоставщику";
		
		Запрос.УстановитьПараметр("ЗаказПоставщику", СписЗаказов);
		ТЗ = Запрос.Выполнить().Выгрузить();
		
		Для каждого строка из ТЗ Цикл
			
			Док = Документы.ЗакрытиеЗаказовПоставщикам.СоздатьДокумент();
			Док.Дата = КонецМесяца(Строка.Дата);
			Стр = Док.Заказы.Добавить();
			Стр.ЗаказПоставщику = Строка.ЗаказПоставщику;
			Стр.Причина = Перечисления.ПричиныКорректировкиСборки.ОтказПоставщика;
			Док.Записать(РежимЗаписиДокумента.Проведение);
			
		КонецЦикла;
		
		Если ДатаПервогоЗаказа <> Неопределено тогда
			РегистрыНакопления.ЗаказыПоставщикам.ПересчитатьИтогиЗаПериод(НачалоМесяца(ДатаПервогоЗаказа), КонецМесяца(ТекущаяДата()));
		КонецЕсли;
		
	КонецЕсли;

КонецПроцедуры
